src/cf/src/DataProcessors/VentesEnDetail/VentesEnDetail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>VentesEnDetail</name>
  <attributes>
    <name>Organisation</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>TabularSection</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/cf/src/InformationRegisters/ИзбраннаяНоменклатураРМК/ИзбраннаяНоменклатураРМК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзбраннаяНоменклатураРМК</name>
  <comment>Избранные позиции кассира для быстрого выбора в РМК без сканирования. Ключ - пользователь, номенклатура, характеристика.</comment>
  <resources>
    <name>Порядок</name>
    <comment>Порядок вывода плитки в окне избранного.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/DataProcessors/VentesEnDetail/Forms/ФормаИзбранного/Module.bsl
// Окно быстрого выбора избранной номенклатуры кассира.
// Плитки строятся программно: группа-карточка + две декорации-надписи (наименование и цена),
// обе - гиперссылки, клик отдаёт позицию в РМК. Снятие избранного - контекстным меню плитки.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заголовок = НСтр("ru = 'Избранное'; fr = 'Favoris'; en = 'Favourites'; es = 'Favoritos'");
	ПостроитьПлитки();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик нажатия на наименование или цену плитки.
// Подключается через УстановитьДействие в ДобавитьПлитку.
//
// Параметры:
//  Элемент - ДекорацияФормы - надпись плитки, по которой кликнули.
//
&НаКлиенте
Процедура ПлиткаНажатие(Элемент)

	Индекс = ИндексПлитки(Элемент.Имя, "ПлиткаНаименование", "ПлиткаЦена");
	Если Индекс = 0 Тогда
		Возврат;
	КонецЕсли;

	Строка = Плитки[Индекс - 1];

	Результат = Новый Структура("Номенклатура, Характеристика, Количество, Цена");
	Результат.Номенклатура = Строка.Номенклатура;
	Результат.Характеристика = Строка.Характеристика;
	Результат.Количество = 1;
	Результат.Цена = Строка.Цена;

	Закрыть(Результат);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик команды контекстного меню плитки «Убрать из избранного».
// Подключается через свойство Действие программно созданной команды.
//
// Параметры:
//  Команда - КомандаФормы - команда плитки, из имени которой берётся её номер.
//
&НаКлиенте
Процедура УбратьПлиткуКоманда(Команда)

	Индекс = ИндексПлитки(Команда.Имя, "УбратьПлитку", "УбратьПлитку");
	Если Индекс = 0 Тогда
		Возврат;
	КонецЕсли;

	УбратьПлиткуНаСервере(Индекс);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УбратьПлиткуНаСервере(Знач Индекс)

	Если Индекс > Плитки.Количество() Тогда
		Возврат;
	КонецЕсли;

	Строка = Плитки[Индекс - 1];
	РегистрыСведений.ИзбраннаяНоменклатураРМК.УбратьИзИзбранного(Строка.Номенклатура, Строка.Характеристика);

	ПостроитьПлитки();

КонецПроцедуры

&НаСервере
Процедура ПостроитьПлитки()

	ОчиститьПлитки();

	ВидЦены = РегистрыСведений.ИзбраннаяНоменклатураРМК.ВидЦенРМК();
	Данные = РегистрыСведений.ИзбраннаяНоменклатураРМК.ИзбранноеПользователя(ВидЦены);

	// Лимит считается по той же выборке, что строит плитки: отдельный счётчик по регистру
	// разошёлся бы с ней, и предупреждение о лишних позициях не сработало бы.
	Всего = Данные.Количество();
	Показано = Мин(Всего, МаксимумПлиток());

	Плитки.Очистить();
	Для НомерСтроки = 1 По Показано Цикл
		ЗаполнитьЗначенияСвойств(Плитки.Добавить(), Данные[НомерСтроки - 1]);
	КонецЦикла;

	Если Всего = 0 Тогда
		ДобавитьНадписьПусто();
		Возврат;
	КонецЕсли;

	ГруппаРяда = Неопределено;
	Индекс = 0;
	Для Каждого СтрокаПлитки Из Плитки Цикл
		Индекс = Индекс + 1;
		Если (Индекс - 1) % ПлитокВРяду() = 0 Тогда
			ГруппаРяда = ДобавитьГруппуРяда(Индекс);
		КонецЕсли;
		ДобавитьПлитку(СтрокаПлитки, Индекс, ГруппаРяда);
	КонецЦикла;

	Если Всего > Показано Тогда
		ДобавитьНадписьЛимита(Показано, Всего);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОчиститьПлитки()

	// Сначала элементы (вместе с ними уходят кнопки их контекстных меню), затем команды:
	// в обратном порядке повторное построение падает на дубле имени.
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого Элемент Из Элементы.ГруппаСетка.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;

	УдаляемыеКоманды = Новый Массив;
	Для Каждого Команда Из Команды Цикл
		Если СтрНачинаетсяС(Команда.Имя, "УбратьПлитку") Тогда
			УдаляемыеКоманды.Добавить(Команда);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Команда Из УдаляемыеКоманды Цикл
		Команды.Удалить(Команда);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ДобавитьГруппуРяда(Индекс)

	ГруппаРяда = Элементы.Добавить("ГруппаРяд" + Формат(Индекс, "ЧГ=0"), Тип("ГруппаФормы"), Элементы.ГруппаСетка);
	ГруппаРяда.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаРяда.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	ГруппаРяда.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаРяда.ОтображатьЗаголовок = Ложь;
	ГруппаРяда.РастягиватьПоГоризонтали = Истина;

	Возврат ГруппаРяда;

КонецФункции

&НаСервере
Процедура ДобавитьПлитку(СтрокаПлитки, Индекс, ГруппаРяда)

	Суффикс = Формат(Индекс, "ЧГ=0");

	ГруппаПлитки = Элементы.Добавить("ГруппаПлитки" + Суффикс, Тип("ГруппаФормы"), ГруппаРяда);
	ГруппаПлитки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПлитки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПлитки.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	ГруппаПлитки.ОтображатьЗаголовок = Ложь;
	ГруппаПлитки.РастягиватьПоГоризонтали = Ложь;

	Наименование = Элементы.Добавить("ПлиткаНаименование" + Суффикс, Тип("ДекорацияФормы"), ГруппаПлитки);
	Наименование.Заголовок = СтрокаПлитки.Наименование;
	Наименование.Гиперссылка = Истина;
	Наименование.АвтоМаксимальнаяШирина = Ложь;
	Наименование.Ширина = ШиринаПлитки();
	Наименование.Высота = 2;
	Наименование.Подсказка = СтрокаПлитки.Наименование;
	Наименование.УстановитьДействие("Нажатие", "ПлиткаНажатие");

	Цена = Элементы.Добавить("ПлиткаЦена" + Суффикс, Тип("ДекорацияФормы"), ГруппаПлитки);
	Цена.Заголовок = ПредставлениеЦены(СтрокаПлитки.Цена);
	Цена.Гиперссылка = Истина;
	Цена.АвтоМаксимальнаяШирина = Ложь;
	Цена.Ширина = ШиринаПлитки();
	Цена.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	Цена.УстановитьДействие("Нажатие", "ПлиткаНажатие");
	Если СтрокаПлитки.Цена > 0 Тогда
		Цена.Шрифт = ШрифтыСтиля.Шрифт_Основной_Увеличенный;
	Иначе
		Цена.ЦветТекста = ЦветаСтиля.Цвет_ПоясняющийТекст;
	КонецЕсли;

	ДобавитьКомандуСнятия(Суффикс, Наименование, Цена);

КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандуСнятия(Суффикс, Наименование, Цена)

	Команда = Команды.Добавить("УбратьПлитку" + Суффикс);
	Команда.Действие = "УбратьПлиткуКоманда";
	Команда.Заголовок = НСтр("ru = 'Убрать из избранного'; fr = 'Retirer des favoris';
		|en = 'Remove from favourites'; es = 'Quitar de favoritos'");

	КнопкаНаименования = Элементы.Добавить("СнятьПоНаименованию" + Суффикс, Тип("КнопкаФормы"),
		Наименование.КонтекстноеМеню);
	КнопкаНаименования.ИмяКоманды = Команда.Имя;

	КнопкаЦены = Элементы.Добавить("СнятьПоЦене" + Суффикс, Тип("КнопкаФормы"), Цена.КонтекстноеМеню);
	КнопкаЦены.ИмяКоманды = Команда.Имя;

КонецПроцедуры

&НаСервере
Процедура ДобавитьНадписьПусто()

	Надпись = Элементы.Добавить("НадписьПусто", Тип("ДекорацияФормы"), Элементы.ГруппаСетка);
	Надпись.Заголовок = НСтр("ru = 'Избранное пусто. Добавьте товар в чек, нажмите на строку правой кнопкой и выберите «В избранное».';
		|fr = 'Aucun favori. Ajoutez un article au ticket, faites un clic droit sur la ligne et choisissez « Ajouter aux favoris ».';
		|en = 'No favourites yet. Add a product to the receipt, right-click the line and choose ""Add to favourites"".';
		|es = 'No hay favoritos. Agregue un artículo al ticket, haga clic derecho en la línea y elija «Agregar a favoritos».'");
	Надпись.ЦветТекста = ЦветаСтиля.Цвет_ПоясняющийТекст;

КонецПроцедуры

&НаСервере
Процедура ДобавитьНадписьЛимита(Показано, Всего)

	Надпись = Элементы.Добавить("НадписьЛимита", Тип("ДекорацияФормы"), Элементы.ГруппаСетка);
	Шаблон = НСтр("ru = 'Показаны первые %1 позиций из %2. Уберите лишнее из избранного.';
		|fr = 'Les %1 premiers articles sur %2 sont affichés. Retirez le superflu des favoris.';
		|en = 'The first %1 items out of %2 are shown. Remove the extra ones from favourites.';
		|es = 'Se muestran los primeros %1 artículos de %2. Quite los sobrantes de favoritos.'");
	ТекстПоказано = Формат(Показано, "ЧГ=0");
	ТекстВсего = Формат(Всего, "ЧГ=0");
	Надпись.Заголовок = СтрШаблон(Шаблон, ТекстПоказано, ТекстВсего);
	Надпись.ЦветТекста = ЦветаСтиля.Цвет_ПоясняющийТекст;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеЦены(Цена)

	Если Цена > 0 Тогда
		Возврат Формат(Цена, "ЧДЦ=2; ЧН=0,00");
	КонецЕсли;

	Возврат НСтр("ru = 'нет цены'; fr = 'pas de prix'; en = 'no price'; es = 'sin precio'");

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндексПлитки(ИмяЭлемента, ПрефиксПервый, ПрефиксВторой)

	Хвост = "";
	Если СтрНачинаетсяС(ИмяЭлемента, ПрефиксПервый) Тогда
		Хвост = Сред(ИмяЭлемента, СтрДлина(ПрефиксПервый) + 1);
	КонецЕсли;
	Если ПустаяСтрока(Хвост) И СтрНачинаетсяС(ИмяЭлемента, ПрефиксВторой) Тогда
		Хвост = Сред(ИмяЭлемента, СтрДлина(ПрефиксВторой) + 1);
	КонецЕсли;

	Если Не СтрокаЭтоЧисло(Хвост) Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Число(Хвост);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаЭтоЧисло(Значение)

	Если ПустаяСтрока(Значение) Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Позиция = 1 По СтрДлина(Значение) Цикл
		Если СтрНайти("0123456789", Сред(Значение, Позиция, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МаксимумПлиток()

	Возврат 40;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПлитокВРяду()

	Возврат 4;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ШиринаПлитки()

	Возврат 24;

КонецФункции

#КонецОбласти
